// Демонстрация создания функции, которая выводит в консоль this
// и объекта, внутри которого определяется  любое свойство и вышесозданная функция.
// демонстрация того, чем будет являться this в каждом из случаев из вышеуказанных случаев

const demoThis = function () {
    console.log(this);
}

demoThis(); // Результатом будет глобальный объект Window.....

const NewObject = {
    color: "red",
    size: 25,

    method: demoThis  // объявляем метод, который вне объекта ссылался на глобальный объект Window
}

NewObject.method(); // Результатом будет объект NewObject